srgordo2005-dev/boigravar/esp32_boi_touch_interno/build/esp32.esp32.esp32/sketch/esp32_boi_touch_interno.ino.cpp
#include <Arduino.h>
#line 1 "C:\\Users\\Felip\\OneDrive\\Documentos\\boi\\esp32_boi_touch_interno\\esp32_boi_touch_interno.ino"
/*
  ESP32 - Cabeça de Boi (Amplificador + Alto-falante 30W)
  VERSÃO: TOUCH INTERNO + mDNS + TELEGRAM + BOTOES EXTRAS
*/

#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <ESPAsyncWebServer.h>
#include <ESPmDNS.h>
#include <LittleFS.h>
#include <Preferences.h>
#include <UniversalTelegramBot.h>
#include <ArduinoJson.h>
#include <ESP8266Audio.h>
#include "AudioFileSourceLittleFS.h"
#include "AudioFileSourcePROGMEM.h"
#include "AudioGeneratorMP3.h"
#include "esp32-hal-dac.h"
#include "audios_progmem.h"

#define DAC_BUF_SIZE 2048
volatile uint8_t dacBuffer[DAC_BUF_SIZE];
volatile int dacHead = 0;
volatile int dacTail = 0;
hw_timer_t * dacTimer = NULL;

#line 160 "C:\\Users\\Felip\\OneDrive\\Documentos\\boi\\esp32_boi_touch_interno\\esp32_boi_touch_interno.ino"
void ligarRele();
#line 165 "C:\\Users\\Felip\\OneDrive\\Documentos\\boi\\esp32_boi_touch_interno\\esp32_boi_touch_interno.ino"
void desligarRele();
#line 374 "C:\\Users\\Felip\\OneDrive\\Documentos\\boi\\esp32_boi_touch_interno\\esp32_boi_touch_interno.ino"
void tocarAgora(String nomeArquivo);
#line 405 "C:\\Users\\Felip\\OneDrive\\Documentos\\boi\\esp32_boi_touch_interno\\esp32_boi_touch_interno.ino"
void ligarAmpliETocar(String track);
#line 420 "C:\\Users\\Felip\\OneDrive\\Documentos\\boi\\esp32_boi_touch_interno\\esp32_boi_touch_interno.ino"
void desligarAmpliSeOcioso();
#line 427 "C:\\Users\\Felip\\OneDrive\\Documentos\\boi\\esp32_boi_touch_interno\\esp32_boi_touch_interno.ino"
void handleNewMessages(int numNewMessages);
#line 453 "C:\\Users\\Felip\\OneDrive\\Documentos\\boi\\esp32_boi_touch_interno\\esp32_boi_touch_interno.ino"
String carregarFaixasDaMemoria();
#line 490 "C:\\Users\\Felip\\OneDrive\\Documentos\\boi\\esp32_boi_touch_interno\\esp32_boi_touch_interno.ino"
void setupWebServer();
#line 636 "C:\\Users\\Felip\\OneDrive\\Documentos\\boi\\esp32_boi_touch_interno\\esp32_boi_touch_interno.ino"
void telegramTask(void *pvParameters);
#line 649 "C:\\Users\\Felip\\OneDrive\\Documentos\\boi\\esp32_boi_touch_interno\\esp32_boi_touch_interno.ino"
void setup();
#line 756 "C:\\Users\\Felip\\OneDrive\\Documentos\\boi\\esp32_boi_touch_interno\\esp32_boi_touch_interno.ino"
void loop();
#line 27 "C:\\Users\\Felip\\OneDrive\\Documentos\\boi\\esp32_boi_touch_interno\\esp32_boi_touch_interno.ino"
void IRAM_ATTR dacTimerIsr() {
  if (dacHead != dacTail) {
    dacWrite(25, dacBuffer[dacTail]);
    dacTail = (dacTail + 1) % DAC_BUF_SIZE;
  }
}

extern float vol;

// Classe customizada para usar o DAC interno com Timer de Hardware
class AudioOutputCustomDAC : public AudioOutput {
  uint32_t sampleInterval;
  int dacPin;
public:
  AudioOutputCustomDAC(int pin = 25) { 
    dacPin = pin; 
    sampleInterval = 22; // ~44.1kHz default
  }
  ~AudioOutputCustomDAC() {}
  
  bool begin() override { 
    dacHead = 0; dacTail = 0;
    if(dacTimer == NULL) {
      dacTimer = timerBegin(1000000); // 1MHz clock base (1 microssegundo)
      timerAttachInterrupt(dacTimer, &dacTimerIsr);
    }
    timerAlarm(dacTimer, sampleInterval, true, 0);
    timerStart(dacTimer);
    return true; 
  }
  bool stop() override { 
    if(dacTimer != NULL) { timerStop(dacTimer); }
    dacWrite(dacPin, 128); // Mantém em 1.65V (silêncio absoluto) para evitar chiado de ground loop
    return true; 
  }
  void flush() override { dacHead = 0; dacTail = 0; }
  bool SetRate(int hz) override { 
    sampleInterval = 1000000 / hz; 
    if(dacTimer) { timerAlarm(dacTimer, sampleInterval, true, 0); }
    return true; 
  }
  bool SetChannels(int channels) override { return true; }
  bool SetOutputModeMono(bool mono) { return true; }
  
  bool ConsumeSample(int16_t sample[2]) override {
    int32_t mixed = (sample[0] + sample[1]) / 2; 
    mixed = (mixed * vol); // Multiplicação direta pelo volume global
    if (mixed > 32767) mixed = 32767;
    if (mixed < -32768) mixed = -32768;
    uint8_t dacValue = (mixed >> 8) + 128;
    
    int nextHead = (dacHead + 1) % DAC_BUF_SIZE;
    while (nextHead == dacTail) {
      yield(); // Buffer cheio, aguarda a interrupção consumir
    }
    
    dacBuffer[dacHead] = dacValue;
    dacHead = nextHead;
    return true;
  }
};

// ==========================================
// CONFIGURAÇÕES DO TELEGRAM
// ==========================================
#define BOT_TOKEN "8910441602:AAEThz37znPwdX3tUoacqfyIOPT3xnElU6c"
#define CHAT_ID "5651208708"

WiFiClientSecure secured_client;
UniversalTelegramBot bot(BOT_TOKEN, secured_client);
unsigned long lastBotCheck = 0;

// ==========================================
// PINOS
// ==========================================
#define PIR_PIN     27
#define NUM_TOUCH   6
const int TOUCH_PINS[NUM_TOUCH] = {32, 33, 13, 15, 2, 12};
#define RELAY_PIN   14
#define BOTAO1_PIN  4
#define BOTAO2_PIN  5

#define TEMPO_DESLIGAR_MS 2000
#define DEBOUNCE_MS       1000   
#define TOUCH_THRESHOLD 35 
#define TEMPO_ESPERA_AMPLI 300 

AsyncWebServer server(80);
Preferences prefs;

AudioGeneratorMP3 *mp3;
AudioFileSource *file = nullptr; // Usaremos ponteiro genérico para suportar PROGMEM e LittleFS
AudioOutputCustomDAC *out;

bool ampliLigado = false;
unsigned long ultimaAtividade = 0;
unsigned long ultimoBotao1 = 0, ultimoBotao2 = 0;

bool esperandoAmpli = false;
unsigned long tempoInicioAmpli = 0;
String trackPendente = "";

bool isAPMode = false;
bool licenciado = true;
bool bloqueado = false;
int offline_plays = 0;

String scanJson = "[]";
unsigned long tempoFimCalibracao = 0;
bool calibrando = false;
unsigned long lastSensoresTime = 0;

int valT[NUM_TOUCH];
int baseTouch[NUM_TOUCH];
int threshDown[NUM_TOUCH];
bool touchHab[NUM_TOUCH];
unsigned long ultimoTouch[NUM_TOUCH];
String trackTouch[NUM_TOUCH];
int toquesValidos[NUM_TOUCH];
uint16_t* calibData[NUM_TOUCH] = {nullptr}; // Array dinâmica para calibração de alta precisão
int calibCount[NUM_TOUCH];
int ultimoMin[NUM_TOUCH];
int ultimoMax[NUM_TOUCH];
bool aguardandoSoltar[NUM_TOUCH];

#define MAX_PLAYLIST 30
String playlist[MAX_PLAYLIST];
int playlistSize = 0;
int currentTrackIndex = 0;

float vol = 1.0;
String bname = "Boi";

void ligarRele() {
  pinMode(RELAY_PIN, OUTPUT);
  digitalWrite(RELAY_PIN, LOW); // 0V = Liga o relé Active Low
}

