srgordo2005-dev/boigravar/esp32_boi_touch_interno/build/esp32.esp32.esp32/sketch/esp32_boi_touch_interno.ino.cpp
void desligarRele() {
  pinMode(RELAY_PIN, OUTPUT);
  digitalWrite(RELAY_PIN, HIGH); // 3.3V = Desliga o relé (pois VCC agora também é 3.3V)
}

bool emCalibracao = false;
unsigned long inicioCalibracao = 0;
int maxT1 = 0, minT1 = 99999;
int maxT2 = 0, minT2 = 99999;
int somaLeituraT[NUM_TOUCH];
int contLeituraT[NUM_TOUCH];

const char INDEX_HTML[] PROGMEM = R"HTML(
<!DOCTYPE html><html><head><meta charset="utf-8"><meta name="viewport" content="width=device-width,initial-scale=1">
<style>
body{font-family:sans-serif;background:#111;color:#eee;margin:0;padding:16px}
h2{color:#4fd1c5; margin-bottom:5px;}
#status{padding:10px;border-radius:8px;font-weight:bold;margin-bottom:14px;text-align:center;}
.liberado{background:#2ecc71;color:#000} .aguardando{background:#f1c40f;color:#000} .bloqueado{background:#e74c3c;color:#fff}
.card{background:#1c1c1c;border-radius:12px;padding:14px;margin-bottom:14px}
select,input[type=file],input[type=range],input[type=text],input[type=password]{width:100%;padding:8px;margin-top:6px;border-radius:8px;border:none;box-sizing:border-box}
button{background:#4fd1c5;border:none;padding:10px 16px;border-radius:8px;font-weight:bold;margin-top:8px;cursor:pointer;color:#000}
.btn-play{background:#2ecc71;padding:6px 12px;margin-left:10px}
li{display:flex;justify-content:space-between;align-items:center;padding:6px 0;border-bottom:1px solid #333}
.acoes{display:flex;gap:10px}
a{color:#ff6b6b;text-decoration:none}
small{color:#888}
</style></head><body>
<h2>Painel do Boi</h2>
<div id="status" class="aguardando">Carregando status...</div>

<div class="card"><b>Configurar Wi-Fi e Nome</b><br>
<form action="/savewifi" method="GET">
<input type="text" id="iptNome" name="bname" placeholder="Nome do Boi (Ex: Boi 01)" required>
<input type="text" name="ssid" list="redes" placeholder="Nome da Rede (SSID)" required autocomplete="off">
<datalist id="redes"></datalist>
<input type="password" name="pass" placeholder="Senha da Rede">
<button type="submit">Salvar e Conectar</button>
</form>
</div>

<div class="card"><b>Enviar novo audio</b><br><small>So MP3 curto (mono, 64kbps)</small><br>
<input type="file" id="f" accept=".mp3"><button onclick="up()">Enviar</button>
<div id="prog"></div></div>

<div class="card"><b>Faixas salvas no Boi</b><ul id="lista"></ul></div>

<div class="card"><b>Monitor de Touch (Ao Vivo)</b><br>
<small style="color:#aaa;"><b>Nova Calibração:</b> Solte os fios, deixe o valor estabilizar e clique em Iniciar Calibração (10s).</small>
<div id="touchContainer"></div>
<div style="margin-top:15px; padding:10px; border-radius:8px; text-align:center; font-weight:bold; background:#333; color:#888;" id="indicadorVoz">Boi em silêncio</div>
<button onclick="zerar()" style="background:#e74c3c; width:100%; margin-top:10px;">Resetar Bloqueio Offline</button>
</div>
<div class="card"><b>Calibração do Touch Interno</b><br>
<button id="btnCalib" onclick="calib()" style="background:#f39c12; width:100%;">Iniciar Calibração (10s)</button>
</div>

<div class="card">
<b>Modo Playlist de Áudios (Toca-Tudo)</b><br>
<small style="color:#aaa;">Todos os sensores de toque e o <b>Botão 1 (Pino 4)</b> tocarão a mesma música. Aperte o <b>Botão 2 (Pino 5)</b> fisicamente na placa para pular de faixa, ou escolha manualmente abaixo:</small><br><br>
Áudio Atual: <select id="selTrack" onchange="setTrack(this.value)" style="width:100%; margin-top:5px;"></select>
</div>

<div class="card">
<b>Armazenamento Seguro do Boi (Memória)</b><br>
<div style="background:#222; border-radius:5px; height:20px; width:100%; margin-top:5px; overflow:hidden;">
  <div id="barMemory" style="background:#3498db; height:100%; width:0%; transition: width 0.5s;"></div>
</div>
<small style="color:#aaa;" id="textMemory">Calculando espaço...</small>
</div>

<div class="card"><b>Volume Geral</b><input type="range" min="0" max="100" id="vol" onchange="setVol(this.value)"></div>

<script>
let numFitas = 6;
let pinos = [32, 33, 13, 15, 2, 12];

function buildDOM() {
  let touchHtml = '';
  for(let i=0; i<numFitas; i++){
    touchHtml += `<div style="font-size:20px; margin-top:15px; color:#f1c40f;">
      <label><input type="checkbox" id="enT${i}" onchange="setEn(${i}, this.checked)"> Fita ${i+1} (Pino ${pinos[i]})</label>: <span id="valT${i}">--</span>
      <div style="font-size:14px; color:#888; margin-top:5px;">
        Base (Máx): <input type="number" id="inB${i}" onchange="setBase(${i}, this.value)" style="width:70px; background:#222; color:#fff; border:1px solid #555; padding:3px; margin-right:10px;">
        Gatilho (Mín): <input type="number" id="inTd${i}" onchange="setThresh(${i}, this.value)" style="width:70px; background:#222; color:#fff; border:1px solid #555; padding:3px;">
      </div>
      <small style="color:#666; font-size:12px;" id="calT${i}">Última calibração -> Máx: -- | Mín: --</small>
    </div>`;
  }
  document.getElementById('touchContainer').innerHTML = touchHtml;
}
buildDOM();

async function carregar(){
  let sR = await fetch('/status'); let sJ = await sR.json();
  let st = document.getElementById('status');
  if(sJ.blq){ st.className='bloqueado'; st.innerText='🔴 TRAVADO (Toques esgotados)'; }
  else if(sJ.lic){ st.className='liberado'; st.innerText='🟢 LIBERADO (Restam ' + (100 - sJ.offp) + ' offline plays)'; }
  else{ st.className='aguardando'; st.innerText='🟡 AGUARDANDO LIBERAÇÃO'; }
  
  if(sJ.bname && sJ.bname != "Boi sem nome"){
      document.getElementById('indicadorVoz').style.color = '#333';
      document.getElementById('iptNome').value = sJ.bname;
  }

  let r = await fetch('/list'); let arr = await r.json();
  let ul=document.getElementById('lista'); ul.innerHTML='';
  arr.forEach(n=>{
    ul.innerHTML+=`<li>${n} <div class="acoes"><button class="btn-play" onclick="play('${n}')">▶</button><a href="#" onclick="del('${n}')">apagar</a></div></li>`;
  });
  
  let sel = sJ.sel;
  let sHtml = '<option value="">(nenhum)</option>';
  for(let i=0; i<sel.f.length; i++) sHtml += `<option value="${sel.f[i]}">${sel.f[i]}</option>`;
  
  document.getElementById('selTrack').innerHTML = sHtml;
  
  for(let i=0; i<numFitas; i++){
    if(document.activeElement.id != 'inTd'+i) document.getElementById('inTd'+i).value = sJ.td[i];
    if(document.activeElement.id != 'inB'+i) document.getElementById('inB'+i).value = sJ.b[i];
    document.getElementById('enT'+i).checked = sJ.en[i];
  }
  
  if(document.activeElement.id != 'selTrack' && document.getElementById('selTrack').options.length > sJ.curTrack + 1) {
    document.getElementById('selTrack').selectedIndex = sJ.curTrack + 1;
  }
  
  let kbUsado = (sJ.used / 1024).toFixed(1);
  let kbTotal = (sJ.total / 1024).toFixed(1);
  let porcentagem = ((sJ.used / sJ.total) * 100).toFixed(0);
  document.getElementById('textMemory').innerText = `${kbUsado} KB usados de ${kbTotal} KB totais (${porcentagem}%)`;
  document.getElementById('barMemory').style.width = porcentagem + '%';
  if (porcentagem > 90) document.getElementById('barMemory').style.background = '#e74c3c';
  else if (porcentagem > 70) document.getElementById('barMemory').style.background = '#f1c40f';
  else document.getElementById('barMemory').style.background = '#2ecc71';
}

async function setTrack(idx_or_name) {
  let tsel = document.getElementById('selTrack');
  await fetch('/setTrack?i=' + tsel.selectedIndex);
}

