srgordo2005-dev/boigravar/esp32_boi_touch_interno/build/esp32.esp32.esp32/sketch/esp32_boi_touch_interno.ino.cpp
async function setBase(t, v) {
  await fetch('/setBase?t='+t+'&v='+v);
}

async function setThresh(t, v) {
  await fetch('/setThresh?t='+t+'&v='+v);
  alert('Gatilho ' + t + ' salvo manualmente com o valor ' + v + '!');
}

async function setEn(t, v) { await fetch('/setEn?t='+t+'&v='+(v?1:0)); }

async function getLiveTouch(){
  try {
    let r = await fetch('/touch_status');
    let j = await r.json();
    for(let i=0; i<numFitas; i++){
      document.getElementById('valT'+i).innerText = j.t[i];
      document.getElementById('calT'+i).innerText = `Última calibração -> Máx: ${j.umax[i]} | Mín: ${j.umin[i]}`;
      // Atualiza as caixinhas automaticamente com a nova calibração (só se não estiver digitando nelas)
      if(document.activeElement.id != 'inB'+i && j.b) document.getElementById('inB'+i).value = j.b[i];
      if(document.activeElement.id != 'inTd'+i && j.td) document.getElementById('inTd'+i).value = j.td[i];
    }
    
    let ind = document.getElementById('indicadorVoz');
    if(j.play){ ind.style.background='#2ecc71'; ind.style.color='#000'; ind.innerText='🎵 TOCANDO AGORA!'; }
    else { ind.style.background='#333'; ind.style.color='#888'; ind.innerText='Boi em silêncio'; }
    
    // Sincroniza a caixa de seleção de áudio com a música atual da placa (ignorando o index 0 que é o "(nenhum)")
    if(document.activeElement.id != 'selTrack' && document.getElementById('selTrack').options.length > j.curTrack + 1) {
      document.getElementById('selTrack').selectedIndex = j.curTrack + 1;
    }
  } catch(e){}
}
setInterval(getLiveTouch, 150);

async function calib(){
  let b = document.getElementById('btnCalib');
  b.innerText = 'Aguarde 10s (NÃO TOQUE NA FITA!)...';
  b.style.background = '#e74c3c';
  await fetch('/calib');
  setTimeout(() => {
    b.innerText = 'Calibrar Sensibilidade';
    b.style.background = '#f39c12';
    alert('Calibração Perfeita (10s) Concluída!');
  }, 10500);
}

async function zerar(){
  await fetch('/zerar');
  alert('Contador de segurança zerado!');
}

async function up(){
  let f=document.getElementById('f').files[0]; if(!f) return;
  let fd=new FormData(); fd.append('file',f);
  document.getElementById('prog').innerText='Enviando...';
  await fetch('/upload',{method:'POST',body:fd});
  document.getElementById('prog').innerText='Concluido!';
  carregar();
}
async function del(n){ await fetch('/delete?file='+encodeURIComponent(n)); carregar(); }
async function play(n){ await fetch('/play?file='+encodeURIComponent(n)); }
async function setVol(v){ await fetch('/volume?v='+v); }
carregar();
</script></body></html>
)HTML";

void tocarAgora(String nomeArquivo) {
  if (nomeArquivo == "") return;
  if (!licenciado || bloqueado) return;

  if (mp3->isRunning()) mp3->stop();
  if (file) delete file;
  
  // Tenta abrir no LittleFS primeiro
  file = new AudioFileSourceLittleFS(("/" + nomeArquivo).c_str());
  
  if(!file->isOpen()){
    delete file;
    file = nullptr;
    // Se não está no LittleFS, procura no PROGMEM
    for(int i = 0; i < num_progmem_audios; i++) {
      if(nomeArquivo == String(progmem_audio_names[i])) {
        file = new AudioFileSourcePROGMEM(progmem_audios[i], progmem_audio_sizes[i]);
        break;
      }
    }
  }
  
  if(file && (file->isOpen() || (file->getSize() > 0))){ // getSize para checar progmem
    mp3->begin(file, out);
    ultimaAtividade = millis();
  } else {
    if (file) delete file;
    file = nullptr;
  }
}

void ligarAmpliETocar(String track) {
  if (track == "") return;
  if (!licenciado || bloqueado) return;
  ultimaAtividade = millis();
  if (!ampliLigado) {
    ligarRele();
    ampliLigado = true;
    esperandoAmpli = true;
    tempoInicioAmpli = millis();
    trackPendente = track;
  } else {
    tocarAgora(track);
  }
}

void desligarAmpliSeOcioso() {
  if (ampliLigado && !mp3->isRunning() && !esperandoAmpli && millis() - ultimaAtividade > TEMPO_DESLIGAR_MS) {
    desligarRele();
    ampliLigado = false;
  }
}

void handleNewMessages(int numNewMessages) {
  for (int i = 0; i < numNewMessages; i++) {
    String chat_id = String(bot.messages[i].chat_id);
    if (chat_id != CHAT_ID) continue; // Segurança
    
    String text = bot.messages[i].text;
    String mac = WiFi.macAddress();
    
    if (text == "/liberar " + mac) {
      licenciado = true;
      prefs.putBool("lic", true);
      bot.sendMessage(chat_id, "✅ Boi liberado e registrado com sucesso!", "");
    }
    else if (text == "/travar " + mac) {
      bloqueado = true;
      prefs.putBool("blq", true);
      bot.sendMessage(chat_id, "🔒 Boi travado com sucesso! Ele não fará mais barulhos.", "");
    }
    else if (text == "/destravar " + mac) {
      bloqueado = false;
      prefs.putBool("blq", false);
  bot.sendMessage(chat_id, "🔓 Boi destravado com sucesso!", "");
    }
  }
}

String carregarFaixasDaMemoria() {
  String json = "{\"f\":[";
  bool first = true;
  playlistSize = 0;
  
  // Adiciona áudios nativos (PROGMEM)
  for(int i = 0; i < num_progmem_audios && playlistSize < MAX_PLAYLIST; i++) {
    String name = String(progmem_audio_names[i]);
    playlist[playlistSize] = name;
    playlistSize++;
    
    if(!first) json += ",";
    json += "\"" + name + "\"";
    first = false;
  }
  
  // Adiciona arquivos do LittleFS
  File root = LittleFS.open("/");
  File f = root.openNextFile();
  while(f && playlistSize < MAX_PLAYLIST){
    if(!f.isDirectory()){
      String name = f.name();
      if(name.endsWith(".mp3") && name != "desconectado.mp3"){
        playlist[playlistSize] = name;
        playlistSize++;
        
        if(!first) json += ",";
        json += "\"" + name + "\"";
        first = false;
      }
    }
    f = root.openNextFile();
  }
  json += "]}";
  return json;
}

void setupWebServer() {
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *r){ r->send_P(200, "text/html", INDEX_HTML); });
  
  server.on("/savewifi", HTTP_GET, [](AsyncWebServerRequest *r){
    String n = r->hasParam("bname") ? r->getParam("bname")->value() : "Boi sem nome";
    String s = r->getParam("ssid")->value();
    String p = r->hasParam("pass") ? r->getParam("pass")->value() : "";
    prefs.putString("bname", n);
    prefs.putString("ssid", s);
    prefs.putString("pass", p);
    r->send(200, "text/html", "<h2>Configuracao salva! O Boi vai reiniciar agora.</h2>");
    delay(2000);
    ESP.restart();
  });

  server.on("/list", HTTP_GET, [](AsyncWebServerRequest *r){
    String json = "[";
    File root = LittleFS.open("/");
    File f = root.openNextFile();
    bool first = true;
    while (f) {
      if (!f.isDirectory() && String(f.name()).endsWith(".mp3")) {
        if (!first) json += ",";
        json += "\"" + String(f.name()) + "\"";
        first = false;
      }
      f = root.openNextFile();
    }
    json += "]";
    r->send(200, "application/json", json);
  });

  server.on("/status", HTTP_GET, [](AsyncWebServerRequest *r){
    String json = "{\"vol\":" + String(vol) + ",\"lic\":" + (licenciado?"true":"false") + ",\"sel\":";
    json += carregarFaixasDaMemoria();
    json += ",\"curTrack\":" + String(currentTrackIndex) + ",\"bname\":\"" + bname + "\",\"td\":[";
    for(int i=0; i<NUM_TOUCH; i++) { json += String(threshDown[i]); if(i < NUM_TOUCH-1) json += ","; }
    json += "],\"b\":[";
    for(int i=0; i<NUM_TOUCH; i++) { json += String(baseTouch[i]); if(i < NUM_TOUCH-1) json += ","; }
    json += "],\"en\":[";
    for(int i=0; i<NUM_TOUCH; i++) { json += (touchHab[i] ? "true" : "false"); if(i < NUM_TOUCH-1) json += ","; }
    json += "],\"used\":" + String(LittleFS.usedBytes()) + ",\"total\":" + String(LittleFS.totalBytes()) + "}";
    r->send(200, "application/json", json);
  });

  server.on("/setTrack", HTTP_GET, [](AsyncWebServerRequest *r){
    if(r->hasParam("i")){
      int i = r->getParam("i")->value().toInt();
      // O índex 0 no HTML geralmente é a opção "(nenhum)"
      if (i > 0 && i - 1 < playlistSize) {
        currentTrackIndex = i - 1;
        prefs.putInt("curTrk", currentTrackIndex);
      }
    }
    r->send(200, "text/plain", "OK");
  });

