srgordo2005-dev/boigravar/esp32_boi_touch_interno/build/esp32.esp32.esp32/sketch/esp32_boi_touch_interno.ino.cpp
  server.on("/delete", HTTP_GET, [](AsyncWebServerRequest *r){
    String file = r->getParam("file")->value();
    LittleFS.remove("/" + file);
    r->send(200, "text/plain", "ok");
  });

  server.on("/volume", HTTP_GET, [](AsyncWebServerRequest *r){
    int v = r->getParam("v")->value().toInt();
    vol = v / 100.0;
    out->SetGain(vol);
    r->send(200, "text/plain", "ok");
  });
  
  server.on("/play", HTTP_GET, [](AsyncWebServerRequest *r){
    String file = r->getParam("file")->value();
    ligarAmpliETocar(file);
    r->send(200, "text/plain", "ok");
  });

  server.on("/calib", HTTP_GET, [](AsyncWebServerRequest *r){
    calibrando = true;
    tempoFimCalibracao = millis() + 10000;
    for(int i=0; i<NUM_TOUCH; i++) {
      somaLeituraT[i] = 99999; // Vamos usar essa variável temporariamente para guardar o valor MÍNIMO (iniciando bem alto)
      contLeituraT[i] = 0;
    }
    r->send(200, "text/plain", "OK");
  });

  server.on("/zerar", HTTP_GET, [](AsyncWebServerRequest *r){
    offline_plays = 0;
    prefs.putInt("offp", 0);
    r->send(200, "text/plain", "zerado");
  });

  server.on("/setThresh", HTTP_GET, [](AsyncWebServerRequest *r){
    if(r->hasParam("t") && r->hasParam("v")){
      int t = r->getParam("t")->value().toInt();
      int v = r->getParam("v")->value().toInt();
      if(t >= 0 && t < NUM_TOUCH) { threshDown[t] = v; prefs.putInt(("td"+String(t)).c_str(), v); }
    }
    r->send(200, "text/plain", "OK");
  });

  server.on("/setBase", HTTP_GET, [](AsyncWebServerRequest *r){
    if(r->hasParam("t") && r->hasParam("v")){
      int t = r->getParam("t")->value().toInt();
      int v = r->getParam("v")->value().toInt();
      if(t >= 0 && t < NUM_TOUCH) { baseTouch[t] = v; prefs.putInt(("bT"+String(t)).c_str(), v); }
    }
    r->send(200, "text/plain", "OK");
  });

  server.on("/setEn", HTTP_GET, [](AsyncWebServerRequest *r){
    if(r->hasParam("t") && r->hasParam("v")){
      int t = r->getParam("t")->value().toInt();
      int v = r->getParam("v")->value().toInt();
      if(t >= 0 && t < NUM_TOUCH) { touchHab[t] = (v == 1); prefs.putBool(("en"+String(t)).c_str(), touchHab[t]); }
    }
    r->send(200, "text/plain", "OK");
  });

  server.on("/touch_status", HTTP_GET, [](AsyncWebServerRequest *r){
    String json = "{";
    json += "\"t\":["; for(int i=0; i<NUM_TOUCH; i++) { json += String(valT[i]); if(i < NUM_TOUCH-1) json += ","; } json += "],";
    json += "\"b\":["; for(int i=0; i<NUM_TOUCH; i++) { json += String(baseTouch[i]); if(i < NUM_TOUCH-1) json += ","; } json += "],";
    json += "\"td\":["; for(int i=0; i<NUM_TOUCH; i++) { json += String(threshDown[i]); if(i < NUM_TOUCH-1) json += ","; } json += "],";
    json += "\"umin\":["; for(int i=0; i<NUM_TOUCH; i++) { json += String(ultimoMin[i]); if(i < NUM_TOUCH-1) json += ","; } json += "],";
    json += "\"umax\":["; for(int i=0; i<NUM_TOUCH; i++) { json += String(ultimoMax[i]); if(i < NUM_TOUCH-1) json += ","; } json += "],";
    json += "\"curTrack\":" + String(currentTrackIndex) + ",";
    json += "\"used\":" + String(LittleFS.usedBytes()) + ",\"total\":" + String(LittleFS.totalBytes()) + ",";
    json += "\"play\":"; json += (mp3->isRunning() ? "true" : "false");
    json += "}";
    r->send(200, "application/json", json);
  });

  server.on("/upload", HTTP_POST,
    [](AsyncWebServerRequest *r){ r->send(200); },
    [](AsyncWebServerRequest *r, String filename, size_t index, uint8_t *data, size_t len, bool final){
      static File up;
      if (index == 0) up = LittleFS.open("/" + filename, "w");
      if (up) up.write(data, len);
      if (final && up) up.close();
    });

  server.begin();
}

TaskHandle_t telegramTaskHandle;
void telegramTask(void *pvParameters) {
  for (;;) {
    if (WiFi.status() == WL_CONNECTED && !mp3->isRunning()) {
      int numNewMessages = bot.getUpdates(bot.last_message_received + 1);
      while (numNewMessages) {
        handleNewMessages(numNewMessages);
        numNewMessages = bot.getUpdates(bot.last_message_received + 1);
      }
    }
    vTaskDelay(60000 / portTICK_PERIOD_MS);
  }
}

void setup() {
  Serial.begin(115200);
  pinMode(PIR_PIN, INPUT_PULLDOWN);
  desligarRele();
  pinMode(BOTAO1_PIN, INPUT_PULLUP);
  pinMode(BOTAO2_PIN, INPUT_PULLUP);

  if(!LittleFS.begin(true)){
    Serial.println("Erro ao montar LittleFS");
    return;
  }

  out = new AudioOutputCustomDAC(25); // Usa o Pino 25 para o DAC nativo
  
  mp3 = new AudioGeneratorMP3();

  prefs.begin("audio", false);
  for(int i=0; i<NUM_TOUCH; i++){
    valT[i] = 2000;
    baseTouch[i] = prefs.getInt(("bT"+String(i)).c_str(), 2000);
    threshDown[i] = prefs.getInt(("td"+String(i)).c_str(), 1900);
    touchHab[i] = prefs.getBool(("en"+String(i)).c_str(), (i < 2)); // Default: só a Fita 1 e 2 ligadas
    ultimoTouch[i] = 0;
    toquesValidos[i] = 0;
    aguardandoSoltar[i] = false;
    ultimoMin[i] = 0;
    ultimoMax[i] = 0;
  }
  
  bname = prefs.getString("bname", "Boi");
  
  carregarFaixasDaMemoria(); // Popula o Array da Playlist inicialmente
  currentTrackIndex = prefs.getInt("curTrk", 0);
  if (currentTrackIndex >= playlistSize && playlistSize > 0) currentTrackIndex = 0;
  offline_plays = prefs.getInt("offp", 0);
  
  String savedSSID = prefs.getString("ssid", "");
  String savedPass = prefs.getString("pass", "");

  secured_client.setInsecure(); // Necessario para o Telegram no ESP32

  bool connected = false;
  if (savedSSID != "") {
    WiFi.begin(savedSSID.c_str(), savedPass.c_str());
    Serial.print("Conectando ao WiFi");
    
    unsigned long startTry = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - startTry < 10000) {
      delay(500);
      Serial.print(".");
    }
    Serial.println();
    
    if (WiFi.status() == WL_CONNECTED) {
      connected = true;
      Serial.print("Conectado! IP: ");
      Serial.println(WiFi.localIP());
      
      // Inicia mDNS (Acesso via http://boi.local)
      if (MDNS.begin("boi")) {
        Serial.println("MDNS ativo! Acesse http://boi.local");
      }

      // Telegram: Envia mensagem apenas uma vez para rastrear instalacao
      bool telegram_enviado = prefs.getBool("tel_env", false);
      if (!telegram_enviado) {
         String bname = prefs.getString("bname", "Sem Nome");
         String msg = "🐂 NOVO BOI CONECTADO!\nNome: " + bname + "\nMAC: " + WiFi.macAddress() + "\nIP Local: " + WiFi.localIP().toString() + "\n\n(A placa ja esta livre de fabrica e pronta para uso)";
         bot.sendMessage(CHAT_ID, msg, "");
         prefs.putBool("tel_env", true);
      }
    } else {
      WiFi.disconnect(); // Corta a tentativa fantasma no fundo para não travar a criação do AP
    }
  }

  if (!connected) {
    Serial.println("Iniciando rede do Boi e Escaneando Wi-Fi...");
    WiFi.mode(WIFI_AP_STA);
    
