srgordo2005-dev/boigravar/esp32_boi_touch_interno/build/esp32.esp32.esp32/sketch/esp32_boi_touch_interno.ino.cpp
    int n = WiFi.scanNetworks();
    scanJson = "[";
    for (int i = 0; i < n; ++i) {
      if (i > 0) scanJson += ",";
      scanJson += "\"" + WiFi.SSID(i) + "\"";
    }
    scanJson += "]";

    String mac = WiFi.macAddress();
    mac.replace(":", "");
    String apName = "BOI-AUDIO-" + mac.substring(mac.length() - 4);
    apName.toUpperCase();

    WiFi.softAP(apName.c_str()); // Rede ABERTA sem senha
    isAPMode = true;
    Serial.print("Rede AP criada: ");
    Serial.print(apName);
    Serial.print(" | IP: ");
    Serial.println(WiFi.softAPIP());
    // Removido som de desconectado no boot
  }

  setupWebServer();
  
  xTaskCreatePinnedToCore(telegramTask, "Telegram", 8192, NULL, 1, &telegramTaskHandle, 0);
}

void loop() {
  if (calibrando) {
    if (millis() < tempoFimCalibracao) {
      for(int i=0; i<NUM_TOUCH; i++){
        if(!touchHab[i]) continue;
        
        // Aloca array dinâmico só durante a calibração
        if(!calibData[i]) {
          calibData[i] = new uint16_t[500];
          calibCount[i] = 0;
        }
        
        int val = touchRead(TOUCH_PINS[i]);
        if(val > 0 && calibCount[i] < 500) {
          calibData[i][calibCount[i]] = val;
          calibCount[i]++;
        }
      }
      delay(20); // 20ms * 500 leituras = 10 segundos!
    } else {
      calibrando = false;
      for(int i=0; i<NUM_TOUCH; i++){
        if(!touchHab[i] || !calibData[i] || calibCount[i] == 0) continue;
        
        // Ordenação Bubble Sort Simples para achar o verdadeiro mínimo estável
        for (int a = 0; a < calibCount[i] - 1; a++) {
          for (int b = 0; b < calibCount[i] - a - 1; b++) {
            if (calibData[i][b] > calibData[i][b+1]) {
              uint16_t temp = calibData[i][b];
              calibData[i][b] = calibData[i][b+1];
              calibData[i][b+1] = temp;
            }
          }
        }
        
        // Descarta os primeiros ~2% (falhas e interferências de 1 milissegundo)
        // Se gravou 500 números, pega o do índice 10 (ignora os 10 menores fantasmas)
        int indexSeguro = (calibCount[i] > 20) ? (calibCount[i] / 50) : 0;
        long baseSegura = calibData[i][indexSeguro];
        
        ultimoMax[i] = calibData[i][calibCount[i]-1]; 
        ultimoMin[i] = baseSegura;
        
        // A Base vira O MENOR NÚMERO DA PESQUISA PURIFICADO
        baseTouch[i] = baseSegura; 
        
        // O Gatilho vira automaticamente a Base menos 50, conforme pedido
        threshDown[i] = baseTouch[i] - 50;
        
        prefs.putInt(("bT"+String(i)).c_str(), baseTouch[i]);
        prefs.putInt(("td"+String(i)).c_str(), threshDown[i]);
        
        delete[] calibData[i];
        calibData[i] = nullptr;
      }
    }
  } // Fim de calibrando sem dar return

  if (mp3->isRunning()) { 
    if (!mp3->loop()) mp3->stop(); 
  }

  if (esperandoAmpli && (millis() - tempoInicioAmpli >= 2000)) {
    esperandoAmpli = false;
    tocarAgora(trackPendente);
    trackPendente = "";
  }

  // Leitura dos sensores a cada 20ms (RESPOSTA INSTANTÂNEA E FILTRADA)
  if (millis() - lastSensoresTime > 20) {
    lastSensoresTime = millis();
    
    // Lê o pino cru na hora, com filtro ultra-leve para ignorar pulos e zeros absolutos
    for(int i=0; i<NUM_TOUCH; i++){
      if(touchHab[i]) {
        int leituraRaw = touchRead(TOUCH_PINS[i]);
        if (leituraRaw > 0) { // Ignora falhas de leitura (0) do hardware
          // Suaviza o ruído em apenas 2 passos (super rápido, não causa lag)
          valT[i] = (valT[i] + leituraRaw) / 2;
        }
      }
    }

    // Só permite acionamento por sensor se estiver licenciado, destravado e NÃO ESTIVER CALIBRANDO
    if (licenciado && !bloqueado && !calibrando) {
      if (digitalRead(PIR_PIN) == HIGH) {
        if (!ampliLigado) {
           ultimaAtividade = millis();
           ligarRele();
           ampliLigado = true;
        }
      }

      for(int i=0; i<NUM_TOUCH; i++){
        if(!touchHab[i]) continue;
        if (valT[i] < threshDown[i]) {
          if (!aguardandoSoltar[i] && !mp3->isRunning()) {
            toquesValidos[i]++;
            // Exige apenas 2 toques válidos (40ms de dedo encostado) para tocar NA HORA
            if (toquesValidos[i] >= 2 && millis() - ultimoTouch[i] > DEBOUNCE_MS) {
              ultimoTouch[i] = millis();
              toquesValidos[i] = 0;
              aguardandoSoltar[i] = true; // OBRIGA A SOLTAR O FIO
              if (playlistSize > 0) { ligarAmpliETocar(playlist[currentTrackIndex]); }
            }
          }
        } else {
          toquesValidos[i] = 0;
          aguardandoSoltar[i] = false; // Liberado para tocar de novo
        }
      }

      if (digitalRead(BOTAO1_PIN) == LOW && millis() - ultimoBotao1 > DEBOUNCE_MS && !mp3->isRunning()) {
        ultimoBotao1 = millis();
        if (playlistSize > 0) { ligarAmpliETocar(playlist[currentTrackIndex]); }
      }

      // Botão 2 (Avançar Faixa) - Funciona mesmo se já estiver tocando música!
      if (digitalRead(BOTAO2_PIN) == LOW && millis() - ultimoBotao2 > DEBOUNCE_MS) {
        ultimoBotao2 = millis();
        if (playlistSize > 0) { 
          currentTrackIndex = (currentTrackIndex + 1) % playlistSize;
          prefs.putInt("curTrk", currentTrackIndex);
          ligarAmpliETocar(playlist[currentTrackIndex]); // Já toca a próxima para ouvir
        }
      }
    }
  }

  desligarAmpliSeOcioso();
}


